#include <iostream>
#include <vector>

using namespace std;

void min_sum_effectiv()
{
    /**
    1.считать 4 числа в червяке
    2.число в хвосте червяка - потенциальный минимум из пройденных
    3. сдвинуть все числа в червяке в лево(0123-1234)
    4.считать  5 число в зубе червяка
    6.собрать пару из того,что в зубах червяка и пройденный минимум
    7.это кандидат на минимальную пару
    8.один ход червяка закончен,повторяем
    **/
}
{

    cout << "Hello world!" << endl;
    return 0;
}
